app/controllers/administration_controller.rb

   def delete_data
     DailyData.delete_all
     MemberPoint.delete_all
     TeamPoint.delete_all
     competition = Competition.find(:first)
     competition.start_date = nil
     competition.save
---
DELETE FROM `daily_datas`
DELETE FROM `member_points`
DELETE FROM `team_points`
UPDATE `competitions` SET `updated_at` = '2011-01-20 14:38:54', `start_date` = NULL WHERE `id` = 1

   def view_member_data
     @dailyData = DailyData.find(:all, :conditions => "member_id = #{params[:id]}", :order => "sample_time DESC")
---
SELECT * FROM `daily_datas` WHERE (member_id = 1) ORDER BY sample_time DESC

   def save_competition
     competition = Competition.find(:first)
     newStartDate = params[:competition][:start_date]
     if newStartDate == ""
       competition.start_date = nil
     else
       competition.start_date = Date::strptime(newStartDate, '%Y-%m-%d')
     end
     competition.save
---
UPDATE `competitions` SET `updated_at` = '2011-01-19 10:08:10', `start_date` = '2011-01-18' WHERE `id` = 1

   def add_team
      return unless request.post?
      team = Team.new(params[:team])
      team.save
---
INSERT INTO `teams` (`name`, `created_at`, `updated_at`, `bg_name`) VALUES('Manchester', '2011-01-31 16:08:32', '2011-01-31 16:08:32', 'Манчестър')

    def remove_team
      team = Team.find(:first, :conditions => "id = #{params[:id]}")
      team.destroy
---
SELECT * FROM `teams` WHERE (id = 1) LIMIT 1
DELETE FROM `teams` WHERE `id` = 1

    def edit_team
      @id = params[:id]
      @team = Team.find(:first, :conditions => "id = #{@id}")
      return unless request.post?
      @team.update_attributes(params[:team])
---
SELECT * FROM `teams` WHERE (id = 3) LIMIT 1
UPDATE `teams` SET `updated_at` = '2011-01-31 16:17:55', `name` = 'Manchester 1', `bg_name` = 'Манчестър 1' WHERE `id` = 5

    def view_team
      @team_id = params[:id]
      @members = Member.find(:all, :conditions => "team_id = #{@team_id}")
---
SELECT * FROM `members` WHERE (team_id = 2)

    def add_member
      @team_id = params[:team_id]
      return unless request.post?
      member = Member.new(params[:member])
      member.save
---
INSERT INTO `members` (`name`, `created_at`, `updated_at`, `mac`, `stream_id`, `team_id`) VALUES('1', '2011-01-21 09:32:24', '2011-01-21 09:32:24', '001F1F3A8A0A', NULL, 4)

    def remove_member
      @team_id = params[:team_id]
      member = Member.find(:first, :conditions => "id = #{params[:id]}")
      member.destroy
---
SELECT * FROM `members` WHERE (id = 2) LIMIT 1
DELETE FROM `members` WHERE `id` = 2