app/controllers/download_controller.rb

SELECT `member_points`.id FROM `member_points` WHERE (`member_points`.`member_id` = 2 AND `member_points`.week = 1) LIMIT 1
INSERT INTO `member_points` (`created_at`, `member_id`, `week`, `updated_at`, `points`) VALUES('2011-01-19 22:13:10', 2, 0, '2011-01-19 22:13:10', 10)
INSERT INTO `team_points` (`created_at`, `week`, `updated_at`, `points`, `team_id`) VALUES('2011-01-19 22:37:21', 0, '2011-01-19 22:37:21', 1, 3)
SELECT * FROM `members` WHERE (team_id=3)
---
  def index

    @message = "success"

    if Competition.has_started?

      time_now =  Time.new

      #time_now = Time.parse("2011-02-14 00:01:00")

      #Download the weekly data and calculate points at the end of 7 day period.
      date_now = Date.parse(time_now.strftime('%Y/%m/%d'))
      competition_days = (date_now - Competition.get_start_date);
      week = competition_days/7
      pointDataTest = MemberPoint.find(:first, :order => "week DESC")
      pointDataTestFlag = (pointDataTest == nil or (time_now.day != pointDataTest.created_at.day and time_now > pointDataTest.created_at))
      if competition_days % 7 == 0 and pointDataTestFlag and week < 13

        #Get all users.
        members = Member.find(:all)

UPDATE `members` SET `updated_at` = '2011-01-17 16:40:23', `stream_id` = '16492942852096' WHERE `id` = 1
---
            res = Net::HTTP.post_form(URI.parse("#{DEHEMS::API_SERVER_ADDRESS}getDataStreamListJSON"),params)
            result = JSON.parse(res.body)
            member.stream_id = result["DataStreamList"][0]["StreamId"]
            member.save

SELECT * FROM `daily_datas` WHERE (member_id=1 and total_kwh=0 and sample_time<='2011-01-18' and sample_time>='2011-01-11') ORDER BY sample_time DESC LIMIT 1
SELECT sum(`daily_datas`.total_kwh) AS sum_total_kwh FROM `daily_datas` WHERE (member_id=11 and total_kwh>0.1 and sample_time<='2011-02-13' and sample_time>='2011-02-06')
---
          member_totals = {}
          members = Member.find(:all, :conditions => "team_id=#{team.id}")
          for member in members
            #Check that we have no zero readings the last 7 days.
            zeroReading = DailyData.find(:all, :conditions => "member_id=#{member.id} and total_kwh<0.1 and sample_time<='#{(date_now - 1.day)}' and sample_time>='#{(date_now - 7.day)}'", :order => "sample_time DESC")