app/controllers/site_controller.rb

SELECT * FROM `teams` WHERE (id=3) LIMIT 1
---
  def view_team
    @title = t(:views__site__index__home)
    @team = Team.find(:first, :conditions => "id=#{params[:id]}")

SELECT * FROM "teams" WHERE (id=5) LIMIT 1
---
  def show_team_history
    @team = Team.find(:first, :conditions => "id=#{params[:id]}")